Repository: pizza-studio/PizzaHelperUnited
Catalog: Packages/GachaKit/Sources/GachaKit/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fil, fr, it, ja, ko, ru, vi, zh_hans, zh_hant

# gachaKit.GachaMetaDBError.EmptyFetchResult
source: Empty results retrieved while trying to online-update GachaMetaDB.
de: Keine Ergebnisse erhalten beim Versuch, GachaMetaDB online zu aktualisieren.
es: Se obtuvieron resultados vacíos al intentar actualizar en línea GachaMetaDB.
fil: Walang nakuha na resulta habang sinusubukang i-online-update ang GachaMetaDB.
fr: Aucun résultat lors de la tentative de mise à jour en ligne de GachaMetaDB.
it: Risultati vuoti recuperati durante il tentativo di aggiornare online GachaMetaDB.
ja: 受け取った資料は空っぽでした（ローカルGachaMetaDBキャッシュのアップデート中の話）。
ko: GachaMetaDB를 온라인 업데이트하는 동안 빈 결과가 검색되었습니다.
ru: При попытке онлайн-обновления GachaMetaDB получены пустые результаты
vi: Không có kết quả nào được truy xuất khi cố gắng cập nhật trực tuyến GachaMetaDB.
zh_hans: 尝试更新 GachaMetaDB 缓存时，获取到的数据是空的。
zh_hant: 嘗試更新 GachaMetaDB 快取時，獲取到的資料是空的。

# gachaKit.GachaMetaDBError.itemIDInvalid
source: ItemID Invalid.
de: Item-ID ungültig.
es: ID del artículo no válido.
fil: Hindi wastong ItemID.
fr: ID de l'objet invalide.
it: ID articolo non valido.
ja: ItemID が無効です。
ko: 잘못된 ItemID입니다.
ru: Недопустимый ID элемента
vi: ItemID không hợp lệ.
zh_hans: ItemID 无效。
zh_hant: ItemID 無效。

# gachaKit.GachaMetaDBError.ResultFetchFailed
source: Failed from attempting to to online-update GachaMetaDB.
de: Fehler beim Versuch, GachaMetaDB online zu aktualisieren.
es: Error al intentar actualizar en línea GachaMetaDB.
fil: Nabigo ang pag-susubok na mag-online update ng GachaMetaDB.
fr: Échec de la tentative de mise à jour en ligne de GachaMetaDB
it: Errore durante il tentativo di aggiornamento online di GachaMetaDB.
ja: 資料の受け取りは失敗しました（ローカルGachaMetaDBキャッシュのアップデート中の話）。
ko: GachaMetaDB 온라인 업데이트 시도 실패.
ru: Ошибка при попытке онлайн-обновления GachaMetaDB
vi: Không thành công từ việc thử cập nhật trực tuyến GachaMetaDB.
zh_hans: 尝试更新 GachaMetaDB 缓存时失败。
zh_hant: 嘗試更新 GachaMetaDB 快取時失敗。

# gachaKit.gachaPullerMenu.chooseGachaPuller
source: Choose Gacha Puller
de: Gacha-Zieher auswählen
es: Elegir tirador de Gacha
fil: Pumili ng Gacha Puller
fr: Choisir le tireur Gacha
it: Scegli il tiratore Gacha
ja: ガチャ主を選択
ko: 가챠 기록 소유자 선택
ru: Выберите владельца гача
vi: Chọn người kéo Gacha
zh_hans: 选择抽卡人
zh_hant: 選擇抽卡人

# gachaKit.GachaRootView.navDescription
source: This app does not contain paid gacha. The Gacha Record Manager in this app only allows users to manage their personal gacha records for some of the games supported by this app. // Your gacha records in this app will only be stored in the private iCloud space of your current Apple ID, as well as on any Apple devices that are signed in with that Apple ID and have this app installed and in-use, hence no privacy concerns needed. // Zenless Zone Zero is currently not supported by this feature.
de: Diese App enthält kein bezahltes Gacha. Der Gacha-Rekordmanager in dieser App ermöglicht es Benutzern lediglich, ihre persönlichen Gacha-Aufzeichnungen für einige der von dieser App unterstützten Spiele zu verwalten. // Ihre Gacha-Aufzeichnungen in dieser App werden nur im privaten iCloud-Bereich Ihrer aktuellen Apple-ID sowie auf allen Apple-Geräten gespeichert, die mit dieser Apple-ID angemeldet sind und auf denen diese App installiert und in Gebrauch ist, sodass keine Datenschutzbedenken bestehen. // Zenless Zone Zero wird derzeit von dieser Funktion nicht unterstützt.
es: Esta aplicación no contiene gacha de pago. El Gestor de Registros de Gacha en esta aplicación solo permite a los usuarios gestionar sus registros personales de gacha para algunos de los juegos compatibles con esta aplicación. // Tus registros de gacha en esta aplicación solo se almacenarán en el espacio privado de iCloud de tu actual ID de Apple, así como en cualquier dispositivo Apple que haya iniciado sesión con ese ID de Apple y tenga esta aplicación instalada y en uso, por lo que no se necesitan preocupaciones sobre la privacidad. // Zenless Zone Zero no es compatible actualmente con esta función.
fil: Walang bayad na gacha sa app na ito. Ang Gacha Record Manager sa app na ito ay nagbibigay-daan lamang sa mga gumagamit na pamahalaan ang kanilang personal na gacha records para sa ilan sa mga laro na sinusuportahan ng app na ito. // Ang iyong mga gacha record sa app na ito ay maiimbak lamang sa pribadong iCloud space ng kasalukuyang Apple ID mo, gayundin sa anumang mga Apple device na naka-sign in gamit ang Apple ID na iyon at may naka-install at ginagamit na app na ito, kaya't walang kinakailangang pag-alalang sa privacy. // Hindi pa kasalukuyang sinusuportahan ng tampok na ito ang Zenless Zone Zero.
fr: Cette application ne contient pas de paiements intégrés. L'enregistrements de vos données de gacha dans cette application permet uniquement de gérer pouvoir les voir et les gérer. Seulement certains sont jeux pris en charge par cette application. Vos données dans cette application seront uniquement stockés dans l'espace iCloud privé de votre identifiant Apple actuel, ainsi que sur tous les appareils Apple qui sont connectés avec cet identifiant Apple et avec cette application installée et utilisée, donc aucune mesure de confidentialité n'est nécessaire. Zenless Zone Zero n'est actuellement pas pris en charge par cette fonctionnalité.
it: Questa app non contiene gacha a pagamento. Il Gestore di Record Gacha in questa app permette solo agli utenti di gestire i propri record personali di gacha per alcuni dei giochi supportati da questa app. // I tuoi record di gacha in questa app saranno memorizzati solo nello spazio privato di iCloud del tuo attuale ID Apple, così come su qualsiasi dispositivo Apple che ha effettuato l'accesso con quell'ID Apple e ha installato e usa questa app, quindi non sono necessarie preoccupazioni sulla privacy. // Zenless Zone Zero attualmente non è supportato da questa funzione.
ja: 当アプリには有料ガチャは含まれておりません。このガチャ記録管理機能は、当アプリのサポート対象としている一部のゲームにおいてユーザーが自分のガチャ記録を管理することのみが可能です。貴殿のガチャ記録は、この端末のログインしている Apple ID の iCloud ストレージ内、そしてその Apple ID のサインイン状態中（且つ当アプリを実装してお用いしていた）Apple デバイスにのみ保存されておりますので、プライバシー上のご配慮は要りません。「ゼンレスゾーンゼロ（絶区ゼロ）」は現時点で当アプリのこの機能のサポート対象外です。
ko: 이 앱에는 유료 가챠가 포함되어 있지 않습니다. 이 앱의 가챠 기록 관리자는 사용자가 이 앱이 지원하는 일부 게임의 개인 가챠 기록을 관리할 수 있도록 합니다. // 이 앱에서의 가챠 기록은 현재 Apple ID의 개인 iCloud 공간과 해당 Apple ID로 로그인하고 이 앱을 설치 및 사용하는 Apple 기기에만 저장되므로 개인정보 보호 문제는 필요하지 않습니다. // 현재 Zenless Zone Zero는 이 기능을 지원하지 않습니다.
ru: Это приложение не содержит платные гачапульты. Менеджер записей гачи в этом приложении позволяет пользователям только управлять своими личными записями гачи для некоторых игр, поддерживаемых этим приложением. // Ваши записи гачи в этом приложении будут храниться только в приватном пространстве iCloud вашего текущего Apple ID, а также на любых устройствах Apple, в которые выполнен вход с этим Apple ID и на которых установлено и используется это приложение, поэтому беспокоиться о конфиденциальности не нужно. // Zenless Zone Zero в настоящее время не поддерживается этой функцией.
vi: Ứng dụng này không có gacha trả phí. Trình quản lý Hồ sơ Gacha trong ứng dụng này chỉ cho phép người dùng quản lý hồ sơ gacha cá nhân của họ cho một số trò chơi được ứng dụng này hỗ trợ. // Hồ sơ gacha của bạn trong ứng dụng này sẽ chỉ được lưu trữ trong không gian iCloud riêng của Apple ID hiện tại của bạn, cũng như trên bất kỳ thiết bị Apple nào đã đăng nhập với Apple ID đó và có ứng dụng này được cài đặt và sử dụng, do đó không cần lo lắng về quyền riêng tư. // Zenless Zone Zero hiện không được tính năng này hỗ trợ.
zh_hans: 本 App 不包含付费转蛋。该抽卡记录管理功能仅允许用户就「被本App所支援的部分游戏」管理自己的个人抽卡（转蛋）记录。您的抽卡记录仅会存储在您当前的 Apple ID 的私有 iCloud 空间内、以及任何登录了该 Apple ID 且有安装使用本 App 的 Apple 设备，不会有隐私上的安全问题。本 App 的抽卡记录管理功能现阶段不提供对绝区零的支持。
zh_hant: 敝應用不包含付費轉蛋。該抽卡記錄管理功能僅允許使用者就「被敝應用所支援的部分遊戲」管理自己的個人抽卡（轉蛋）記錄。您的抽卡記錄僅會存儲在您當前的 Apple ID 的私有 iCloud 空間內、以及任何登入了該 Apple ID 且有安裝使用敝應用的 Apple 裝置，不會有隱私上的安全問題。敝應用的抽卡記錄管理功能現階段不提供對絕區零的支援。

# gachaKit.GachaRootView.navTitle
source: Gacha Record Manager
de: Gacha-Aufzeichnungsmanager
es: Administrador de Registro de Gacha
fil: Tagapamahala ng Tala ng Gacha
fr: Historique Gacha
it: Gestore dei Record Gacha
ja: ガチャ記録管理
ko: 가챠 기록 관리자
ru: Менеджер записей Гача
vi: Trình quản lý ghi chép Gacha
zh_hans: 抽卡记录管理
zh_hant: 抽卡記錄管理

# gachaKit.getRecord.chart.count
source: Count
de: Anzahl
es: Contar
fil: Bilang
fr: Quantité
it: Conteggio
ja: 総数
ko: 개수
ru: Подсчет
vi: Đếm
zh_hans: 数量
zh_hant: 數量

# gachaKit.getRecord.chart.date
source: Date
de: Datum
es: Fecha
fil: Petsa
it: Data
ja: 日付
ko: 날짜
ru: Дата
vi: Ngày tháng
zh_hans: 日期
zh_hant: 日期

# gachaKit.getRecord.failFetch.retry
source: Retry
de: Wiederholen
es: Reintentar
fil: Subukang Muli
fr: Réessayer
it: Riprova
ja: 再試行
ko: 재시도
ru: Повторить
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

# gachaKit.getRecord.fetchRange.allAvailable
source: All Fetchable Range
de: Gesamter verfügbarer Bereich
es: Todo el rango disponible
fil: Buong saklaw na maaaring makuha
fr: Plage disponible complète
it: Tutta la gamma disponibile
ja: 取得可能な全範囲
ko: 모든 가져오기 가능 범위
ru: Весь доступный диапазон
vi: Toàn bộ phạm vi có thể lấy
zh_hans: 所有可获取范围
zh_hant: 所有可取得範圍

# gachaKit.getRecord.fetchRange.recent30Days
source: Recent 30 Days
de: Letzte 30 Tage
es: Últimos 30 días
fil: Nakaraang 30 araw
fr: 30 derniers jours
it: Ultimi 30 giorni
ja: 過去 30 日間
ko: 최근 30일
ru: Последние 30 дней
vi: 30 ngày gần đây
zh_hans: 最近 30 天
zh_hant: 最近 30 天

# gachaKit.getRecord.fetchRange.recent60Days
source: Recent 60 Days
de: Letzte 60 Tage
es: Últimos 60 días
fil: Nakaraang 60 araw
fr: 60 derniers jours
it: Ultimi 60 giorni
ja: 過去 60 日間
ko: 최근 60일
ru: Последние 60 дней
vi: 60 ngày gần đây
zh_hans: 最近 60 天
zh_hant: 最近 60 天

# gachaKit.getRecord.fetchRange.recent72Hours
source: Recent 72 Hours
de: Letzte 72 Stunden
es: Últimas 72 horas
fil: Nakaraang 72 oras
fr: 72 dernières heures
it: Ultime 72 ore
ja: 過去 72 時間
ko: 최근 72시간
ru: Последние 72 часа
vi: 72 giờ gần đây
zh_hans: 最近 72 小时
zh_hant: 最近 72 小時

# gachaKit.getRecord.fetchRange.recentWeek
source: Recent Week
de: Letzte Woche
es: Última semana
fil: Nakaraang Linggo
fr: Dernière semaine
it: Ultima settimana
ja: 過去 1 週間
ko: 지난주
ru: Последняя неделя
vi: Tuần gần đây
zh_hans: 最近一周
zh_hant: 最近一週

# gachaKit.getRecord.fetchRange.title
source: Time Range
de: Zeitraum
es: Rango de tiempo
fil: Saklaw ng Oras
fr: Plage horaire
it: Intervallo di tempo
ja: 期間範囲
ko: 시간 범위
ru: Временной диапазон
vi: Khoảng thời gian
zh_hans: 时间范围
zh_hant: 時間範圍

# gachaKit.getRecord.finished.footer.bleachedInvalidEntriesCount
source: Invalid entries bleached:
de: Ungültige Einträge bereinigt:
es: Entradas inválidas depuradas:
fil: Mga invalid na entry na naalis:
fr: Entrées invalides nettoyées :
it: Voci non valide eliminate:
ja: 削除した無効なる記録の数:
ko: 무효 항목 정리됨:
ru: Недействительные записи очищены:
vi: Các mục không hợp lệ đã được làm sạch:
zh_hans: 已清理的无效本地记录数量:
zh_hant: 已清理的無效本機記錄數量:

# gachaKit.getRecord.finished.footer.nothingToBleach
source: No invalid local entries found.
de: Keine ungültigen lokalen Einträge gefunden.
es: No se encontraron entradas locales inválidas.
fil: Walang invalid na lokal na entry na natagpuan.
fr: Aucune entrée locale invalide trouvée.
it: Nessuna voce locale non valida trovata.
ja: 無効なる記録は見つかりませんでした。
ko: 무효한 로컬 항목이 발견되지 않았습니다.
ru: Недействительных локальных записей не найдено.
vi: Không tìm thấy mục không hợp lệ nào.
zh_hans: 尚未发现无效的本地记录。
zh_hant: 尚未發現無效的本機記錄。

# gachaKit.getRecord.finished.initialize
source: Initialize
de: Initialisieren
es: Inicializar
fil: Ipasimula
fr: Initialiser
it: Inizializza
ja: 初期化
ko: 초기화
ru: Инициализировать
vi: Khởi tạo
zh_hans: 初始化
zh_hant: 初始化

# gachaKit.getRecord.finished.succeeded
source: Succeeded in fetching gacha records
de: Beschaffung der Gacha-Daten erfolgreich
es: Registros de gacha obtenidos con éxito
fil: Tagumpay sa pagkuha ng tala ng gacha
fr: Récupération de l'historique gacha réussi
it: Riuscito a ottenere i record del gacha
ja: ガチャ履歴を取得完了
ko: 가차 기록 가져오기 성공
ru: Получены данные гача.
vi: Lấy lịch sử gacha thành công
zh_hans: 获取抽卡记录成功
zh_hant: 獲取抽卡記錄成功

# gachaKit.getRecord.gotSome.gotNewRecords
source: New: %lld
de: Neu: %lld
es: Nuevo: %lld
fil: Bago: %lld
fr: Nouveau : %lld
it: Nuovo: %lld
ja: 新記録数: %lld
ko: 새로운: %lld
ru: Новое: %lld
vi: Mới: %lld
zh_hans: 新记录数: %lld
zh_hant: 新記錄數: %lld

# gachaKit.getRecord.gotSome.obtaining
source: Obtaining gacha records...
de: Gacha-Datensätze werden abgerufen...
es: Obteniendo registros de gacha...
fil: Kinukuha ang mga tala ng gacha...
fr: Récupération de l'historique gacha...
it: Ottenere i record gacha...
ja: ガチャ履歴を取得中...
ko: 가챠 기록을 가져오는 중...
ru: Получение записей гача...
vi: Đang lấy dữ liệu gacha...
zh_hans: 正在获取抽卡记录……
zh_hant: 正在獲取抽卡記錄……

# gachaKit.getRecord.gotSome.page
source: Page: %lld
de: Seite: %lld
es: Página: %lld
fil: Pahina: %lld
it: Pagina: %lld
ja: ページ: %lld
ko: 페이지: %lld
ru: Страница: %lld
vi: Trang: %lld
zh_hans: 页数: %lld
zh_hant: 頁數: %lld

# gachaKit.getRecord.inProgress.cancel
source: Stop
de: Stopp
es: Detener
fil: Tigil
fr: Arrêter
it: Interrompi
ja: ストップ
ko: 중지
ru: Стоп
vi: Dừng
zh_hans: 停止
zh_hant: 停止

# gachaKit.getRecord.inProgress.obtaining
source: Obtaining gacha records...
de: Abrufen von Gacha-Aufzeichnungen...
es: Obteniendo registros gacha...
fil: Kinukuha ang mga tala ng gacha...
fr: Récupération de l'historique gacha...
it: Ottenimento dei record gacha...
ja: ガチャ履歴を取得中...
ko: 가챠 기록 가져오는 중...
ru: Получение записей гача...
vi: Đang thu thập hồ sơ gacha...
zh_hans: 正在获取抽卡记录……
zh_hant: 正在獲取抽卡記錄……

# gachaKit.getRecord.quickFetch
source: or tap an account to fetch (Miyoushe-governed UIDs only):
de: oder tippe auf ein Konto, um zu laden (nur Miyoushe UIDs):
es: o toca una cuenta para obtener (solo UIDs de Miyoushe):
fil: o i-tap ang account upang makuha (Miyoushe UID lang):
fr: ou appuyez sur un compte pour récupérer (UIDs Miyoushe uniquement):
it: o tocca un account per recuperare (solo ID di Miyoushe):
ja: あるいは下記のいずれの（米遊社在籍のUIDのみ）アカウントをタップして直接取得：
ko: 또는 계정을 눌러 가져오기(미유셰 UID만 해당):
ru: или нажмите на аккаунт, чтобы получить (только Miyoushe UID):
vi: hoặc chạm vào một tài khoản để lấy (chỉ áp dụng cho UID Miyoushe):
zh_hans: 或点击下述受米游社管辖的 UID 直接获取记录:
zh_hant: 或點按下述受米遊社管轄的 UID 直接獲取記錄:

# gachaKit.getRecord.readyStart.copyThisURL
source: Copy this URL to clipboard
de: Diesen URL in die Zwischenablage kopieren
es: Copie esta URL al portapapeles
fil: Kopyahin ang URL na ito sa clipboard
fr: Copier l'URL
it: Copia questo URL negli appunti
ja: この URL をクリップボードに書き込む
ko: 이 URL을 클립보드에 복사하기
ru: Скопируйте этот URL в буфер обмена
vi: Sao chép URL này vào bảng tạm
zh_hans: 将该 URL 复制到剪贴板
zh_hant: 將該 URL 複製到剪貼簿

# gachaKit.getRecord.readyStart.enableBleachingMode
source: Bleach Invalid Local Records
de: Ungültige lokale Einträge bereinigen
es: Limpiar registros locales inválidos
fil: Linisin ang Mga Di-wastong Lokal na Rekord
fr: Nettoyer les enregistrements locaux invalides
it: Pulire i record locali non validi
ja: 異常なる既存データを掃除する
ko: 잘못된 로컬 기록 제거
ru: Очистить недействительные локальные записи
vi: Xóa các bản ghi cục bộ không hợp lệ
zh_hans: 清理既存的异常记录
zh_hant: 清理既存的異常記錄

# gachaKit.getRecord.readyStart.forceOverride
source: Force-override existing entries
de: Vorhandene Einträge überschreiben erzwingen
es: Forzar la sobrescritura de entradas existentes
fil: Piliting i-override ang umiiral na mga entry
fr: Forcer le remplacement des entrées existantes
it: Forza la sovrascrittura delle voci esistenti
ja: 既存の記録を上書きする
ko: 기존 항목 강제 덮어쓰기
ru: Принудительно перезаписать существующие записи
vi: Ghi đè cưỡng bức các mục hiện có
zh_hans: 覆盖既存记录
zh_hant: 覆寫既存記錄

# gachaKit.getRecord.readyStart.reinit
source: Paste another gacha history URL
de: Fügen Sie eine weitere Gacha-Verlauf-URL ein
es: Pega otra URL de historial de gacha
fil: I-paste ang isa pang gacha history URL
fr: Coller une autre URL d'historique gacha
it: Incolla un altro URL di cronologia gacha
ja: 他のガチャ履歴のURLをペースト
ko: 다른 가챠 내역 URL 붙여넣기
ru: Вставьте другой URL истории гачи
vi: Dán một URL lịch sử gacha khác
zh_hans: 粘贴另一个抽卡历史记录 URL
zh_hant: 貼上另一個抽卡歷程記錄URL

# gachaKit.getRecord.readyStart.sectionFooter.regardingTrashDataIncidents
source: We are not authorized to publicly state what actually happened on the server hosting official gacha records. The following descriptions are assumptions based on observations. Due to possible occasional server-side issues, the game server might return duplicated gacha entries with incorrect transaction IDs, potentially polluting the local database. If the bleaching mode is enabled, this app will use the latest fetch results as the trusted source for correct transaction IDs and remove possibly incorrect entries locally, but this could be affected by potentially polluted data from the game server. Nevertheless, once a game version deprecates, all gacha records during its operation period are likely to become static and trustworthy.
de: Wir sind nicht befugt, öffentlich zu erklären, was tatsächlich auf dem Server mit den offiziellen Gacha-Daten passiert ist. Die folgenden Beschreibungen sind Annahmen, die auf Beobachtungen basieren. Aufgrund möglicher gelegentlicher Serverprobleme könnte der Spielserver möglicherweise doppelte Gacha-Einträge mit falschen Transaktions-IDs zurücksenden, was die lokale Datenbank verschmutzen könnte. Wenn der Bleichmodus aktiviert ist, verwendet diese App die neuesten Abrufergebnisse als vertrauenswürdige Quelle für korrekte Transaktions-IDs und entfernt die möglicherweise falschen Einträge lokal. Dies kann jedoch durch potenziell verschmutzte Daten des Spielservers beeinträchtigt werden. Trotzdem werden alle Gacha-Daten nach Ablauf einer Spielversion vermutlich statisch und vertrauenswürdig.
es: No estamos autorizados a declarar públicamente qué pasó realmente en el servidor que aloja los registros oficiales de gacha. Las siguientes descripciones son suposiciones basadas en observaciones. Debido a posibles problemas ocasionales del servidor, el servidor del juego podría devolver entradas de gacha duplicadas con identificaciones de transacción incorrectas, lo que podría contaminar la base de datos local. Si el modo de blanqueo está activado, esta aplicación usará los resultados más recientes como fuente confiable para identificaciones correctas y eliminará las entradas posiblemente incorrectas localmente, aunque esto podría verse afectado por datos potencialmente contaminados del servidor del juego. Sin embargo, una vez que una versión del juego quede obsoleta, es probable que todos los registros de gacha de su período de operación se vuelvan estáticos y confiables.
fil: Kami ay hindi awtorisadong maghayag sa publiko kung ano ang aktuwal na nangyari sa server na nagho-host ng mga opisyal na rekord ng gacha. Ang mga sumusunod na paglalarawan ay mga palagay batay sa mga obserbasyon. Dahil sa posibleng mga paminsan-minsang isyu sa server, maaaring magbalik ang game server ng mga dobleng gacha entry na may maling transaction ID, na posibleng magdulot ng polusyon sa lokal na database. Kung naka-enable ang bleaching mode, gagamitin ng app na ito ang pinakabagong resulta ng pagkuha bilang mapagkakatiwalaang pinagmulan ng tamang transaction ID at aalisin ang mga posibleng maling entry nang lokal, ngunit maaaring maapektohan ito ng potensyal na kontaminadong data mula sa game server. Gayunpaman, kapag ang isang game version ay nag-expire, malamang na ang lahat ng gacha record mula sa operasyon nito ay magiging static at mapagkakatiwalaan.
fr: Nous ne sommes pas autorisés à déclarer publiquement ce qui s'est réellement passé sur le serveur hébergeant les enregistrements officiels de gacha. Les descriptions suivantes sont des suppositions basées sur des observations. En raison de possibles incidents ponctuels côté serveur, le serveur de jeu pourrait renvoyer des entrées gacha dupliquées avec des identifiants incorrects, ce qui pourrait polluer la base de données locale. Si le mode de nettoyage est activé, cette application utilisera les derniers résultats d'extraction comme source fiable pour les identifiants corrects et supprimera les entrées potentiellement incorrectes localement, bien que cela puisse être affecté par des données potentiellement polluées du serveur de jeu. Cependant, une fois qu'une version du jeu est obsolète, il est probable que tous les enregistrements gacha de sa période d'exploitation deviennent statiques et fiables.
it: Non siamo autorizzati a dichiarare pubblicamente cosa è realmente accaduto sul server che ospita i record ufficiali di gacha. Le seguenti descrizioni sono supposizioni basate su osservazioni. A causa di possibili incidenti occasionali lato server, il server di gioco potrebbe restituire voci gacha duplicate con ID di transazione errati, potenzialmente inquinando il database locale. Se è abilitata la modalità di sbiancamento, questa app utilizzerà gli ultimi risultati come fonte attendibile per identificare correttamente gli ID di transazione e rimuoverà le voci possibilmente errate localmente, ma ciò potrebbe essere influenzato da dati potenzialmente inquinati dal server di gioco. Tuttavia, una volta che una versione del gioco è obsoleta, è probabile che tutti i record gacha del suo periodo operativo diventino statici e affidabili.
ja: 公式のガチャ記録を提供するサーバーで実際に何が起こったかは、当アプリの開発チームとして断言することではありませんので、以下の説明は、観察に基づく推測です。サーバー側の偶発的な問題が起こる可能性により、ゲームサーバーから送り返されるガチャ記録データが重複したり、取扱番号に誤りがあったりする可能性があります。この結果、端末内のデータベースが汚染される可能性があります。「異常なる既存データを掃除する」スイッチがONの場合、このアプリは最新のガチャ記録を基準として、端末内のデータベースの取扱番号が正しいかどうかを点検し、誤ったデータを排除しようとします。しかし、この汚染現象により、点検中の判断が誤る可能性があります。いずれにせよ、ゲームのサービスが終了する時点で、サービス期間中のすべてのガチャ記録は、おそらくサーバー側で確定し、信頼できる結果となるでしょう。
ko: 우리는 공식 가챠 기록을 호스팅하는 서버에서 실제로 무슨 일이 일어났는지 공개적으로 말할 권한이 없습니다. 다음 설명은 관찰에 기반한 가정입니다. 서버 측에서 발생할 수 있는 간헐적인 문제로 인해, 게임 서버가 잘못된 트랜잭션 ID와 함께 중복된 가챠 항목을 반환할 가능성이 있어, 로컬 데이터베이스를 오염시킬 수 있습니다.漂白 모드가 활성화된 경우, 이 앱은 최신 데이터를 신뢰 소스로 사용하여 로컬에서 잠재적으로 잘못된 항목을 제거하려고 하지만, 게임 서버에서 오는 잠재적으로 오염된 데이터에 의해 영향을 받을 수 있습니다. 그러나 게임 버전이 종료되면, 운영 기간 동안의 모든 가챠 기록은 아마도 고정되어 신뢰할 수 있게 될 것입니다.
ru: Мы не уполномочены публично заявлять, что именно произошло на сервере, где хранятся официальные записи гача. Следующие описания являются предположениями, основанными на наблюдениях. Из-за возможных случайных сбоев на сервере игра может возвращать д하며, как только версия игры устаревает, вероятно, все записи гача за период её работы станут статичными и надёжными.
vi: Chúng tôi không được phép công khai tuyên bố điều gì thực sự đã xảy ra trên máy chủ lưu trữ các bản ghi gacha chính thức. Các mô tả sau đây là những giả định dựa trên quan sát. Do các sự cố có thể xảy ra ở máy chủ, máy chủ trò chơi có thể trả về các mục gacha trùng lặp với ID giao dịch không chính xác, có khả năng gây ô nhiễm cơ sở dữ liệu cục bộ. Nếu chế độ tẩy trắng được bật, ứng dụng này sẽ sử dụng kết quả mới nhất làm nguồn tin cậy cho ID giao dịch chính xác và loại bỏ các mục có thể sai cục bộ, nhưng điều này có thể bị ảnh hưởng bởi dữ liệu tiềm tàng bị ô nhiễm từ máy chủ trò chơi. Tuy nhiên, khi phiên bản trò chơi không còn được hỗ trợ, có lẽ tất cả các bản ghi gacha trong giai đoạn hoạt động của nó sẽ trở nên ổn định và đáng tin cậy.
zh_hans: 我们无权公开断言「托管官方抽卡记录的服务器实际发生了什么」。以下描述是基于观察的假设。由于服务器端可能偶发的故障，服务器回传的抽卡记录数据可能会出现重复或带有错误的流水号，这可能会造成本地数据库被污染。如果启用「清理既存的异常记录」，本 App 将以最新获取的抽卡记录作为依据，判断本地数据库的流水号是否正确，并据此筛除可能错误的记录。但这个过程可能会因潜在的污染数据而受到影响。无论如何，当某个游戏版本结束营运时，营运期间的所有抽卡记录很可能会在服务器端固定下来，成为可信结果。
zh_hant: 我們無權公開斷言「托管官方抽卡記錄的伺服器實際發生了什麼」。以下描述是基於觀察的假設。由於伺服器端可能偶發的故障，伺服器回傳的抽卡記錄資料可能會出現重複或帶有錯誤的流水號，這可能會造成本機資料庫被污染。如果啟用「清理既存的異常記錄」，敝應用將以最新獲取的抽卡記錄作為依據，判斷本機資料庫的流水號是否正確，並據此篩除可能錯誤的記錄。但這個過程可能會因潛在的污染資料而受到影響。無論如何，當某個遊戲版本結束營運時，營運期間的所有抽卡記錄很可能會在伺服器端固定下來，成為可信結果。
